---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpaceTypeGbxml
source: html/82666c03-c6e4-c449-b3ca-482916f844c0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpaceTypeGbxml Property

"Space Type (gbXML)"

## Syntax (C#)
```csharp
public static ForgeTypeId SpaceTypeGbxml { get; }
```